<template>
  <view class="flex flex-col h-full">
    <uni-nav-bar />
    <h-status-header :title="type === '1' ? 'COSMOPlat用户协议' : 'COSMOPlat隐私协议'" />

    <scroll-view scroll-y class="p-16 box font-28 w-full flex-1 overflow-hidden">
      <template v-if="type === '1'">
        <view class="font-24">
          <view>协议版本：v1.0</view>
          <view>发布日期：2022-12-1</view>
          <view>生效日期：2022-12-1</view>
          <view>业务系统：海云智造</view>
        </view>
        <br />
        <view class="bold mt-16">卡奥斯海云智造用户服务协议</view>
        <view class="bold my-16">
          一. 前言<br />
          二.服务使用对象 <br />
          三. 账号注册<br />
          四. 账号注销<br />
          五. 收费<br />
          六. 用户使用规范<br /> </view><br />

        欢迎您使用卡奥斯海云智造及相关服务（以下简称“本平台”），在您使用之前请您务必仔细阅读本平台协议（以下简称“本协议”）。本平台服务由海尔数字科技（青岛）有限公司及相关联公司（以下简称“海尔数科”或“我们”，关联公司包括海尔数字科技（上海）有限公司、海尔数字科技（北京）有限公司、海尔数字科技（重庆）有限公司、海尔数字科技（无锡）有限公司、海尔数字科技（天津）有限公司、海尔数字科技（西安）有限公司等）提供。本协议所述用户（以下简称“您”或“用户”）为访问或使用的任何个人、法人或其他组织。本协议将构成您与我们之间直接有法律约束力的文件。<br /><br />
        <view class="bold my-16">一、前言</view><br />
        1、本协议将用以确定、调整和管理在使用服务时作为服务提供商的与作为服务使用者的用户之间的法律关系。您使用本服务（包括但不限于注册、登录、或使用等行为）即表示您已充分阅读、理解并同意您已经与我们订立本协议，且您将受本协议的条款和条件（“条款”）约束。若您是未满18周岁的自然人，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用本服务。<br />
        2、当您使用的某一特定服务时，该服务可能会有一些特殊条款（“特殊条款”）。该等特殊条款应被视为本协议的补充，是本协议不可分割的组成部分。如本协议与任何特殊条款之间存在分歧，在分歧的范围内以特殊条款约定为准。<br />
        3、我们可酌情在适用法律和法规允许的限度之内不时修订本协议。如本协议的任何修订对您的权利或义务具有实质影响，我们将通过合理方式提前通知您。如在本协议修订生效之后，您继续使用，则代表您已阅读、理解并无条件同意此类更改。当您与我们发生争议时，应以最新的服务协议为准。<br />
        4、本协议内容包括协议正文及已经发布或将发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。<br />
        <view class="bold my-16">二、服务使用对象</view><br />
        仅供能够根据相关法律订立具有法律约束力的合约的个人或法人或其他组织使用。因此，您的年龄必须在十八周岁或以上，才可使用。如不符合本项条件，请勿单独使用。可随时自行全权决定拒绝向任何人士提供平台信息，包括被暂时或永久中止资格的用户。<br />
        <view class="bold my-16">三、账号注册</view><br />
        1、旨在让您通过一个账号便利享受所有服务，因此为使用之目的，您需要开立一个账号（以下简称“账号”）。如您在注册，您同意以下内容：<br />
        （1）根据我们的要求，提供关于您的真实、准确、完整和反映当前情况的资料。<br />
        （2）维持并及时更新资料，使其保持真实、准确、完整和反映当前情况。倘若您提供任何不真实、不准确、不完整或不能反映当前情况的资料，或有合理理由怀疑该等资料不真实、不准确、不完整或不能反映当前情况，如您提供的上述资料不真实、不准确、不完整或不能反映当前情况，导致有关您的任何权益纠纷，我们不对此承担责任。<br />
        2、您应时刻注意自己的账号安全（例如避免使用过于简单的用户密码、避免与第三方共用账号）。我们不对任何未经授权使用您账号而导致的损失负责。如您发现任何未经授权的账号使用行为或其他账号安全问题（例如密码被盗）时，您应立即通过COSMOPlat的客服（400-135-7277）联系我们。如果发生了（或有合理理由怀疑发生了）任何未经授权使用您的账号的行为，保留终止您的账号的权利。<br />
        3、您充分了解并同意，您须为您账号下的一切行为负责。为免疑义，不对任何由您账号引起的损害或损失负责<br />
        4、您理解并承诺，您设置的帐号不得违反国家法律法规及本服务相关规则，您的帐号名称、头像和简介等用于使用本服务的信息及其他向我们提供的信息中不得出现违法或不良信息，未经他人许可不得使用他人名义（包括但不限于通过冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）注册帐号，不得恶意注册帐号。您在帐号使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益或者有害社会良好道德风尚的行为。我们有权对您提交的注册信息进行审核，对于违反本条款约定的注册信息，我们有权视情况采取不予注册、屏蔽或删除违法违规内容、不经通知暂停使用、冻结帐号、注销或收回帐号等措施，您应自行承担因此导致不能使用帐号或与之相关的服务与功能所造成的损失。如果您违反本协议或进行违法活动，有权终止您的账号。您应对因此引起的任何和全部损失承担责任（包括因此遭受的损失）。<br />
        <view class="bold my-16">四、账号注销</view><br />
        1、如果您确认注销账号，您的账号需同时满足以下条件：<br />
        （1）您所申请注销的账号应当是您依照本平台相关规则注册并由本平台提供给您本人的账号，您应当依照本平台规定的程序或网站上的提示进行账号注销。<br />
        （2）在最近两周内，账号没有进行更改密码、更改绑定信息等敏感操作，账号没有被盗、被封等风险。<br />
        （3）账号在本平台无应当履行而尚未履行完毕的义务。 <br />
        （4）账号无任何纠纷，包括投诉举报或被投诉举报。<br />
        （5）账号为正常使用中的账号且当前账号未处于可限制状态。
        您提交注销账号申请后，该申请不可撤销，因此请您谨慎操作。<br />
        2、账号注销将导致本平台终止为您提供相关服务，同时您将会丧失以下权益或资产：<br />
        （1）您将无法登录、使用本平台账号；您的个人身份信息、账号信息（包含昵称、头像、消息记录等）、会员权益、发布的内容（包括但不限于产品、文章、图片、链接、评论等内容）将无法找回，您的账号将不可被检索、访问。<br />
        （2）您在注销账号前使用的头像、账号、昵称等信息将被释放，且允许其他第三方另行在本平台上进行注册使用；且您在使用本平台服务过程中根据《卡奥斯移动中台用户服务协议》、《隐私政策》及其他规则对本平台进行的知识产权授权仍然有效。<br />
        （3）您绑定本平台的第三方账号（如新浪微博、腾讯QQ、微信等）将会被解绑，且该等第三方账号可另行与本平台新的账号进行绑定。<br />
        （4）您将无法再使用本平台账号登录授权或绑定关系的APP或网站。<br />
        （5）您在注销账号前未使用的积分、优惠券等全系将会被清零，建议您申请注销前进行使用。<br />
        您理解并同意，账号一旦被注销将不可恢复，本平台无法协助您重新恢复前述权益或资产，请您在操作之前，确保您的账号无任何纠纷，并自行备份账号相关的所有信息和数据，否则您应自行承担因所需信息和数据丢失所产生的风险。<br />
        3、您在确定注销账号后，可以通过本协议公布的联系方式，申请删除您的个人信息（如有）。<br />
        例外情况：在法律、行政法规规定的保存期限未届满或删除个人信息从技术上难以实现的，我们将无法完全删除您的个人信息。但我们将停止除存储和采取必要的安全保护措施之外的个人信息处理。<br />
        若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，要求其及时删除，除非法律法规另有规定，或这些主体获得您的独立授权。<br />
        当您从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。<br />
        响应请求的例外： 在以下情形中，按照法律法规要求，我们将无法响应您的上述请求：<br />
        （1）与国家安全、国防安全直接相关的；<br />
        （2）与公共安全、公共卫生、重大公共利益直接相关的；<br />
        （3）与犯罪侦查、起诉、审判和执行判决等直接相关的；<br />
        （4）证据表明您可能存在明显恶意、滥用权力及占用平台资源、辱骂客服人员等相关情形的（如您的请求将危害公共安全）；<br />
        （5）您和其他人合法权益，或您的请求超出了一般技术手段和商业成本可覆盖的范围；<br />
        （6）响应个人信息主体的请求将导致您或其他个人、组织的合法权益受到严重损害的；<br />
        （7）涉及商业秘密的。<br />
        4、在您账号注销审核期间，如果您的账号涉及或可能涉及争议、纠纷，包括但不限于投诉、举报、诉讼、仲裁、国家有权机关调查等，我们有权自行中止或终止本账号的注销而无需另行得到您的同意。<br />
        5、如在账号注销后，我们发现或者接到其他第三方投诉、举报您在注销账号前的行为存在违法违规或其他侵权情形的，我们有权依据法律法现等相关规定进行处理。注销本账号并不代表此账号注销前的账号行为和相关责任得到豁免或减轻。<br />
        6、我们保留在您违反适用法律法规规定或违反本协议的情况下冻结、注销您的帐号并删除或匿名化处理您所存储的数据、文件的权利，且无需为此向您承担任何责任，由此带来的因您使用本服务产生的全部数据、信息等被清空、丢失等的损失，您应自行承担。<br />
        <view class="bold my-16">五、收费 </view><br />
        您因进行交易、向获取有偿服务或接触服务器而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由您自行承担。保留在无须发出书面通知，仅在平台公示的情况下，暂时或永久地更改或停止部分或全部平台的权利。<br />

        <view class="bold my-16">六、用户使用规范 </view><br />
        6.1行为要求<br />
        您应正确配置和使用本服务，并自行采取一定的安全性措施，对您的内容进行保护和备份。您声明并保证您接入本服务的算法、模型、数据、产品、服务的安全性、稳定性、有效性，不包含任何其他软件程序，不存在病毒、蠕虫、木马和其他有害的计算机的代码、文件、脚本和程序，也不存在任何一项恶意软件特征，不会对我们和/或其关联方的相关系统造成损害，亦不会对我们和/或其关联方或其他第三方数据造成损害。由于您的内容引起的安全漏洞，包括但不限于病毒、木马、蠕虫或其他有害程序，或由于您未按照本协议约定使用服务而引起的安全漏洞，由您自行负责并承担责任。<br />
        您使用本服务不得：<br />
        1、使用未经我们授权或许可的任何插件、外挂、系统、程序或第三方工具对本服务的正常运行进行干扰、破坏、修改或施加其他影响，包括但不限于使用自动化脚本等方式收集来自本服务的信息或与本服务互动、大量占用本服务系统或者网络带宽资源，给本服务系统或者使用本服务的其他用户的网络、服务器、产品或应用带来严重负荷，影响系统通畅。<br />
        2、利用或针对本服务进行任何危害计算机网络安全的行为，包括但不限于：<br />
        （1）非法侵入网络、干扰网络正常功能、窃取网络数据等危害网络安全的活动；<br />
        （2）提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；<br />
        （3）明知他人从事危害网络安全的活动的，为其提供技术支持、广告推广、支付结算等帮助；<br />
        （4）使用未经许可的数据或进入未经许可的服务器/帐号；<br />
        （5）未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；<br />
        （6）未经许可，企图探查、扫描、测试本服务系统或网络的弱点或其它实施破坏网络安全的行为；<br />
        （7）企图干涉、破坏本服务系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；<br />
        （8）伪造TCP/IP数据包名称或部分名称；<br />
        （9）复制、模仿、修改、翻译、改编、出借、出售、转许可、在信息网络上传播或转让相关服务，或对本服务及相关服务进行反向工程、反向汇编、编译或者以其他方式尝试发现本服务的源代码；<br />
        （10）恶意注册我们帐号，包括但不限于频繁、批量注册帐号；<br />
        （11）违反法律、法规、协议、我们的相关规则及侵犯他人合法权益的其他行为。<br />
        3、将本服务用于广告目的或进行任何商业推销或复制、经销、许可、转让、租赁或出售本服务的全部或部分。<br />
        4、绕过我们可能用于阻止或限制访问服务的任何措施。 5、将本服务或其任何部分纳入任何其他程序或产品。<br />
        6、冒充他人或其他组织机构，或对您自己的身份或您与他人或其他组织机构的关系作出虚假或不当的陈述，包括给人以您上传、发布、传播、散布或提供的任何内容是出自本服务的印象。<br />
        7、未经我们授权而使用或试图使用他人的帐号、服务或系统，或在本服务创建一个虚假身份。<br />
        8、超出正常好友或用户之间信息沟通、交流等目的（包括但不限于为发送广告、垃圾、骚扰或违法违规等信息的目的），通过自己添加或诱导他人添加等任何方式使自己与其他用户形成好友关系。<br />
        9、将本服务用于操作核设施、飞机导航和通讯系统、空中交通管制、生命支持系统、武器系统等类似的高风险场景或某些特定目的。如果您将本服务用于高风险场景而导致人员伤亡、财产损失或环境破坏，我们不承担责任。<br />
        10、进行违反法律法规、本规范、我们的相关规则及侵犯他人合法权益的其他行为。<br />
        6.2信息内容规范<br />
        1、您使用本服务开发、制作、利用、上传、评论、发布、传播、存储、分享的内容（包括但不限于上传至本服务的未公开分享的内容）应自觉遵守相关法律法规，否则我们有权立即采取相应处理措施。您不得利用本服务制作、复制、存储、发表、传播下列信息：<br />
        （1）反对宪法确定的基本原则的； <br />
        （2）危害国家安全，泄露国家秘密的；<br />
        （3）颠覆国家政权，推翻社会主义制度，煽动分裂国家，破坏国家统一的；<br />
        （4）损害国家荣誉和利益的；<br />
        （5）宣扬恐怖主义、极端主义的；<br />
        （6）宣扬民族仇恨、民族歧视，破坏民族团结的；<br />
        （7）煽动地域歧视、地域仇恨的；<br />
        （8）破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
        （9）编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的；<br />
        （10）散布、传播淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br />
        （11）危害网络安全、利用网络从事危害国家安全、荣誉和利益的；<br />
        （12）侮辱或者诽谤他人，侵害他人合法权益的；<br />
        （13）对他人进行暴力恐吓、威胁，实施人肉搜索的；<br />
        （14）歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；<br />
        （15）散布污言秽语，损害社会公序良俗的；<br />
        （16）侵犯他人隐私权、名誉权、肖像权、知识产权等合法权益内容的；<br />
        （17）任何未经我们或接收方同意的广告、招揽推广材料、“垃圾邮件”、“垃圾短信”、“连锁信”、“传销”或任何其它被禁止的招揽形式内容；<br />
        （18）侵害未成年人合法权益或者损害未成年人身心健康的；<br />
        （19）其他违反法律法规、公共政策、社会治安及公序良俗、干扰本服务正常运营或侵犯其他用户或第三方合法权益内容的其他信息。<br />
        2、如果我们发现或收到他人举报或投诉用户违反本协议约定的，我们有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚，并公告处理结果。<br />
        3、您的资料和供买卖的物品<br />
        （1）在通过上传、传送、展示或者以其他方式提供任何信息、材料或其他内容（“用户创建内容”）时，您同意向授予不可撤销的、无限制的、可转授权的、世界范围内的、无偿的、永久的以及非排他性的许可，允许以任何方式或者以现在或以后开发的任何媒介将您的用户创建内容用于任何目的（商业、广告或其他目的），包括但不限于对此类用户内容进行复制、修改、编辑、改编、翻译、展示（“用户内容使用许可”）。会视其具体使用用户创建内容的情境决定如何署名。如您对是否以及如何署名有专门要求的，请在提供您的用户创建内容时予以书面告知。<br />
        （2）您应对自己提供的用户创建内容，以及由您创建内容所引起的、或与其相联系的任何结果负完全责任（包括因此可能遭受的任何损失）。您特此承诺：<br />
        a、拥有与用户创建内容相关的所有权利，或已被授权；<br />
        b、用户创建内容不侵犯任何知识产权或其他任何第三方的权利（例如您应拥有用户创建内容中的每一位可识别个人的明示同意和/或许可，以使用前述每一位可识别个人的姓名或肖像）；<br />
        c、用户创建内容不包含任何病毒或其他有害代码等； <br />
        d、用户创建内容不包含“垃圾邮件”或任何未经同意的营销活动；<br />
        e、用户创建内容不包含任何法律法规、行政规章等（包括但不限于《互联网信息服务管理办法》、《互联网跟帖评论服务管理规定》、《互联网用户账号名称管理规定》）所禁止的其他内容（例如淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容），或本协议禁止的内容。<br />
        对于任何违反本条承诺的情况，保留删除或拒绝发布任何用户创建内容或终止您的账号的权利。您保证不招致任何第三方的相关索偿，一旦发生，您同意对因您违反上述保证所遭致的任何损失进行赔偿。<br />
        （3）对用户创建内容概不负责。任何用户创建内容中表达的观点并不代表的观点或价值观。仅作为分发此类用户创建内容的渠道，并不对任何用户创建内容表示认可或对任何用户创建内容或活动承担任何相关义务或责任。在任何情况下，您不应轻信借款、索要密码或其他涉及财产的用户创建内容。<br />
        （4）没有责任去认定或决定您提交给本公司的资料哪些是应当受到保护的，对平台的其他用户使用“您的用户创建内容”，也不必负责。<br />
        4、您授予的许可使用权 您完全理解并同意不可撤销地授予我们及关联主体下列权利：<br />
        （1）对于您提供的资料，您授予我们及关联主体独家的、全球通用的、永久的、免费的许可使用权利（并有权在多个层面对该权利进行再授权），使或关联主体有权（全部或部份地）使用、复制、修订、改写、发布、翻译、分发、执行和展示“您的资料”或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将“您的资料”纳入其他作品内。<br />
        （2）当您违反本协议或与签订的其他协议的约定，我们有权以任何方式通知关联公司，要求其对您的权益采取限制措施包括但不限于要求将您账号内的款项支付给指定的对象，要求关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。<br />
        5、处理交易争议<br />
        （1）不涉及用户间因交易而产生的法律关系及法律纠纷，不会且不能牵涉进交易各方的交易当中。倘若您与一名或一名以上用户，或与您通过获取其服务的第三者服务供应商发生争议，您免除（我们及我们的代理人和雇员）在因该等争议而引起的，或在任何方面与该等争议有关的不同种和性质的任何（实际和后果性的）权利主张、要求和损害赔偿等方面的责任。<br />
        （2）有权受理并调处您与其他用户因交易产生的争议，同时有权单方面独立判断其他用户对您的投诉及（或）索偿是否成立，若判断索偿成立，则您应及时使用自有资金进行偿付，否则有权使用您交纳的保证金（如有）或扣减已购服务中未履行部分的费用的相应金额或您在所有账号下的其他资金（或权益）等进行相应偿付。没有使用自用资金进行偿付的义务，但若进行了该等支付，您应及时赔偿的全部损失，否则有权通过前述方式抵减相应资金或权益，如仍无法弥补的损失，则保留继续追偿的权利。因非司法机构，您完全理解并承认，对证据的鉴别能力及对纠纷的处理能力有限，受理贸易争议完全是基于您之委托，不保证争议处理结果符合您的期望，亦不对争议处理结果承担任何责任。有权决定是否参与争议的调处。<br />
        （3）有权通过电子邮件等联系方式向您了解情况，并将所了解的情况通过电子邮件等方式通知对方，您有义务配合的工作，否则有权做出对您不利的处理结果。<br />
        （4）经生效法律文书确认您存在违法或违反本协议行为或者自行判断您涉嫌存在违法或违反本协议行为的，我们有权在平台公布您的违法行为并做出处罚（包括但不限于限权、终止服务等）。<br />
        6、交易系统<br />
        （1）不得操纵交易。您同意不利用帮助实现蒙蔽或欺骗意图的同伙（下属的客户或第三方），操纵与另一交易方所进行的商业谈判的结果。<br />
        （2）系统完整性。您同意，您不得使用任何装置、软件或程序干预或试图干预的正常运作或正在上进行的任何交易。您不得采取对任何将不合理或不合比例的庞大负载加诸本公司网络结构的行动。您不得向任何第三者披露您的密码，或与任何第三者共用您的密码，或为任何未经批准的目的使用您的密码。您应当对您在本网站账号上的操作承担全部责任。<br />
        （3）不作商业性利用。您同意，您不得对任何资料作商业性利用，包括但不限于在未经事先书面批准的情况下，复制在展示的任何资料并用于商业用途。<br />
        7、终止或访问限制<br />
        （1）您同意，在未向您收费的情况下，可自行全权决定以任何理由（包括但不限于认为您已违反本协议的约定，或您以不符合本协议约定的方式行事，或您在超过90天的时间内未以您的账号及密码登录）终止您的本网站密码、账号（或其任何部份）或您对本网站的使用，并删除和丢弃您在使用本网站中提交的“您的资料”。<br />
        （2）您同意，在向您收费的情况下，应基于合理的怀疑且经电子邮件通知的情况下实施上述终止服务的行为。同时可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供平台服务或其任何部份。<br />
        （3）您同意，根据本协议的任何规定终止您使用平台之措施可在不发出事先通知的情况下实施，并承认和同意，可立即使您的账号无效，或撤销您的账号以及在您的账号内的所有相关资料和档案，和/或禁止您进一步接入该等档案或平台。账号终止后，没有有义务为您保留原账号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。<br />
        （4）您同意，不会就终止您接入平台而对您或任何第三者承担任何责任。 <br />
        8、违反规则的后果<br />
        在不限制其他补救措施的前提下，发生下述任一情况，可立即发出警告，暂时中止、永久中止或终止您的账号，删除您的任何现有产品信息，以及您在展示的任何其他资料：<br />
        （1）您违反本协议； <br />
        （2）无法核实或鉴定您向我们提供的任何资料；<br />
        （3）相信您的行为可能会使您、用户或通过提供服务的第三者服务供应商发生任何法律责任。<br />
        在不限制任何其他补救措施的前提下，倘若发现您从事涉及的诈骗活动，可暂停或终止您的账号。<br />
        9、服务“按现状”提供<br />
        我们会尽一切努力使您正常地使用平台提供的服务。遗憾的是，不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，您明确理解和同意，您使用的风险由您自行承担。以“按现状”和“按可得到”的基础提供。明确声明不作出任何种类的所有明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。对下述内容不作保证：<br />
        （1）会符合您的要求； <br />
        （2）网站不会中断，且适时、安全和不带任何错误；<br />
        （3）通过使用而可能获取的结果将是准确或可信赖的；<br />
        （4）您通过而购买或获取的任何产品、服务、资料或其他材料的质量将符合您的预期。<br />
        通过使用而下载或以其他形式获取任何材料是由您自行全权决定进行的，且与此有关的风险由您自行承担，对于因您下载任何该等材料而发生的您的电脑系统的任何损毁或任何数据损失，您将自行承担责任。您从获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证。<br />
        10、责任范围<br />
        您明确理解和同意，我们不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿（无论是否已被告知该等损害赔偿的可能性）：<br />
        （1）使用或未能使用平台；<br />
        （2）因通过或从平台购买或获取任何货物、样品、数据、资料或服务，或通过或从平台接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用；<br />
        （3）未经批准接入或更改您的传输资料或数据；<br />
        （4）任何第三者的声明或相关的行为；<br />
        （5）因任何原因而引起的有关的任何其他事宜，包括疏忽。<br />
        11、赔偿<br />
        您同意，因您违反本协议或经在此提及而纳入本协议的其他文件，或因您违反了法律或侵害了第三方的权利，而使第三方对或其关联主体提出索赔要求（包括司法费用和其他专业人士的费用），您必须赔偿给我们或其关联主体，使其等免遭损失。<br />
        12、遵守法律<br />
        您应遵守与您使用，以及与您竞买、购买和销售任何物品以及提供商贸信息有关的所有相关的法律、法规、条例和规章。<br />
        13、无代理关系<br />
        您与我们仅为独立订约人关系。本协议无意结成或创设任何代理、合伙、合营、雇用与被雇用或特许权授予与被授予关系。<br />
        14、广告和金融服务<br />
        您与我们在或通过物色的刊登广告人士通讯或进行业务往来或参与其推广活动，包括就相关货物或服务付款和交付相关货物或服务，以及与该等业务往来相关的任何其他条款、条件、保证或声明，仅限于在您和该刊登广告人士之间发生。您同意，对于因任何该等业务往来或因在出现该等刊登广告人士而发生的任何种类的任何损失或损毁，无需负责或承担任何责任。您如打算通过创设或参与任何公司、股票行情、投资或证券有关的任何服务，或通过收取或要求与任何公司、股票行情、投资或证券有关的任何新闻信息、警戒性信息或其他资料，敬请注意，不会就通过平台传送的任何该等资料的准确性、有用性或可用性、可获利性负责或承担任何责任，且不会对根据该等资料而作出的任何交易或投资决策负责或承担任何责任。<br />
        15、链接<br />
        我们或第三者均可提供与其他网站或资源链接。由于并不控制该等网站和资源。您承认并同意：我们并不对该等外在网站或资源的可用性负责，且不认可该等网站或资源上或可从该等网站或资源获取的任何内容、宣传、产品、服务或其他材料，也不对其等负责或承担任何责任。您进一步承认和同意，对于任何因使用或信赖从此类网站或资源上获取的此类内容、宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，均不承担责任。<br />
        16、不可抗力<br />
        对于因合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使延迟或未能履约的，不对您承担任何责任。<br />
        17、转让 转让本协议的权利义务无需经您同意。<br />
        18、其他规定<br />
        本协议取代您和先前就相同事项订立的任何书面或口头协议。<br />
        本协议各方面应受中华人民共和国大陆地区法律的管辖。<br />
        倘若本协议任何规定被裁定为无效或不可强制执行，该项规定应被撤销，而其余规定应予执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。未就您或其他人士的某项违约行为采取行动，并不表明撤回就任何继后或类似的违约事件采取行动的权利。<br />
        本协议的解释权归海尔数字科技（青岛）有限公司所有。 <br />
        19、诉讼<br />
        因本协议或服务所引起或与其有关的任何争议应向青岛市崂山区人民法院提起诉讼。<br />
      </template>
      <template v-else>
        <view class="font-24">
          <view>协议版本：v3.1</view>
          <view>发布日期：2022-10-27</view>
          <view>生效日期：2022-10-27</view>
          <view>业务系统：海云智造</view>
        </view>
        <view class="bold my-16">卡奥斯海云智造隐私政策</view>
        本政策仅适用于海尔数字科技（青岛）有限公司的卡奥斯海云智造提供的产品和服务，卡奥斯海云智造提供记工、审产、在制库存管理、生产分析等功能模块。<br />
        如果您有任何疑问、意见或建议，请通过以下任一联系方式与我们联系：<br />
        电话：400-135-7277<br />
        地址：青岛市崂山区高新产业创新园D1座3206室<br />

        卡奥斯海云智造（以下简称“我们”）非常重视您的信任，并深知个人信息对于您的重要性，我们将按照法律法规的规定，保护您的个人信息安全。我们将恪守以下原则，保护您的个人信息安全：权责一致原则、目的明确原则、选择同意原则、最小必要原则、确保安全原则、主体参与原则、公开透明原则等。<br />
        【特别提示】请您仔细阅读我们的《卡奥斯海云智造隐私政策》（尤其是加粗或划线的内容）并确定了解我们对您个人信息的处理规则。阅读过程中，如您有任何疑问，可及时与我们联系（联系方式以隐私政策里约定的为准）。如您选择不同意协议中的任何条款，您应立即停止访问本平台。<br />
        卡奥斯海云智造非常重视用户的隐私和个人信息保护。您在使用我们的产品与/或服务时，我们可能会收集和使用您的相关信息。我们希望通过《卡奥斯海云智造隐私政策》（以下简称“本隐私政策”）向您说明在您使用我们的产品与/或服务时，我们如何收集、使用、保存、共享和转让这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。<br />
        为了保护卡奥斯海云智造用户隐私权，优化用户体验，卡奥斯海云智造制定本隐私政策。本隐私政策旨在帮助您了解我们会收集哪些数据、为什么收集这些数据，会利用这些数据做些什么及如何保护这些数据。我们希望您在使用卡奥斯海云智造服务前仔细阅读并明确您已经充分理解、接受本隐私政策的内容，希望您可以根据自己的理解做出合适的选择。您同意隐私政策仅代表您已了解本平台提供的功能，以及功能运行所需的必要个人信息，并不代表您已同意我们可以收集非必要个人信息，非必要个人信息会根据您使用过程中的授权情况单独征求您的同意。在我们更新本隐私政策后，您继续使用我们的产品和/或服务，即意味着您同意本隐私政策（含更新版本）内容，并且同意我们按照本隐私政策收集、使用、保存和共享您的相关信息。此外，当我们将您的个人信息用于本隐私政策未涵盖的用途时，我们会事先征求您的同意。请您特别注意：本隐私政策适用于我们以平台、客户端、小程序以及随技术发展出现的新形态向您提供的各项产品和服务。<br />
        下文将帮您详细了解我们如何收集、使用、存储、委托处理、共享、转让（如适用）、公开披露与保护您的个人信息。并且帮您了解访问、删除、更正、撤回授权个人信息的方式。<br />

        <view class="bold mt-16">一、我们如何收集和使用您的个人信息 </view><br />
        <view class="bold mt-16">二、我们如何使用 Cookie 和同类技术 </view><br />
        <view class="bold mt-16">三、我们如何委托处理、共享、转让、公开披露您的个人信息 </view><br />
        <view class="bold mt-16">四、我们如何保护您的个人信息 </view><br />
        <view class="bold mt-16">五、您的权利 </view><br />
        <view class="bold mt-16">六、我们如何处理未成年人的个人信息 </view><br />
        <view class="bold mt-16">七、本隐私权政策如何更新 </view><br />
        <view class="bold mt-16">八、如何联系我们 </view><br />

        <view class="bold my-16">一、我们如何收集和使用您的个人信息 </view><br />

        在您使用卡奥斯海云智造提供的服务过程中，我们将收集以下必要的相关个人信息，以及部分您可以选择提供的个人信息。<br />
        1、注册、登录与个人信息维护<br />
        第一，当您注册、登录本服务时，您需要通过手机号或邮箱、密码创建卡奥斯海云智造帐号，并且您可以完善相关的网络身份识别信息（头像、昵称、密码）。如果您仅浏览卡奥斯海云智造官网，您不需要注册卡奥斯海云智造帐号并提供上述信息。<br />
        第二，当您代表客户注册本服务时，您可能还需提供企业/组织主体证照等基本信息，以便我们帮助客户完成认证。您确认已获得这类客户的充分授权签署并同意本隐私政策的全部内容。<br />
        第三，当您进行个人信息维护时，您可能需要提供个人电话号码、住址、邮箱地址、所在行业、职位、公司名称、公司地址、公司规模，但是此类信息并非必填项。<br />
        2、短信、邮件通知<br />
        您在使用我们的服务时，我们可能使用您的信息向您的设备发送电子邮件、新闻或推送通知。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。<br />
        3、用户评价 在您进行用户评价内容填写时，我们会收集您的ip地址信息、手机号。<br />
        4、文档下载<br />
        当您进行文档下载时，我们会获取您的姓名、个人电话号码、公司名称相关的信息。<br />
        5、用户登录日志<br />
        为了更好的向您提供服务，我们会收集您的用户登录日志，包括：数据来源、用户名、手机号信息。<br />
        6、建议反馈<br />
        当您提供建议反馈时，我们会收集您的手机信息。<br />
        7、供需发布<br />
        当您作为企业进行供需发布时，我们会收集您的联系人姓名、联系手机号、公司名称、所属行业信息。<br />
        8、通过第三方SDK收集信息<br />
        我们可能会获得您在使用第三方合作伙伴服务时所产生或分享的信息。在与合作方合作过程中，将遵守以下原则：<br />
        合法原则：涉及数据处理活动的，应当遵守合法原则。<br />
        正当最小与必要原则：数据使用必须具有正当目的，且应以达成目的的必要为限。<br />
        安全审慎原则：我们将审慎评估合作方使用数据的目的，对这些合作方的安全保障能力进行评估，并要求其遵循合作法律协议。我们会对合作方获取信息的软件工具开发包（SDK）、应用程序接口（API）进行严格的安全检测，以保护您的数据安全。<br />
        安卓操作系统重点应用权限列表： 权限名称 权限功能说明 使用场景或目的 READ_CALENDAR 读取日历<br />
        读取您系统中的日历活动用于在日历中添加日程提醒 WRITE_CALENDAR 编辑日历 添加或修改系统中的日历活动 CAMERA 拍摄<br />
        使用拍摄照片和视频、录制视频时使用 READ_CONTACTS 读取通讯录<br />
        获取系统中的通信录信息，第三方组件在其相关功能所必需的情况下，会向您申请该权限，并通过其协议说明使用的目的，请您在授权前仔细阅读。<br />
        GET_ACCOUNTS 获取应用账户
        获取设备上已安装的应用创建的账号，请您放心，该权限仅获取应用相关的信息，无法获取您的银行账号密码等个人敏感信息用于帮助您通过第三方账号登录App
        ACCESS_FINE_LOCATION 访问精准定位
        通过全球定位系统（GPS）或网络位置信息（例如基站和WLAN）获取精准地理位置信息，用于完成音视频等信息发布内容上传以及基于地理位置的服务（LBS）等相关功能
        ACCESS_COARSE_LOCATION 访问粗略位置
        通过网络位置信息（例如基站和WLAN）获取大致地理位置信息，用于完成音视频等信息发布内容上传以及基于地理位置的服务（LBS）等相关功能
        RECORD_AUDIO 录音 使用麦克风录制音频，用于帮助您完成音视频等信息发布等需要使用该权限的相关功能 READ_PHONE_STATE
        读取电话状态 提供读取手机设备标识等信息，请您放心该权限无法监听、获取您的任何通话内容与信息
        READ_EXTERNAL_STORAGE 读取外置存储器
        提供读取手机储存空间内数据的功能，允许App读取存储中的图片、文件等内容，主要用于帮助您发布信息，在本地记录崩溃日志信息（如有）等功能
        WRITE_EXTERNAL_STORAGE 写入外置存储器
        提供写入外部储存功能，允许App写入/下载/保存/修改/删除图片、文件、崩溃日志等信息 iOS 操作系统重点应用权限列表：
        权限名称 权限功能说明 使用场景或目的 NSPhotoLibraryAddUsageDescription 向相册中添加内容
        允许App写入/下载/保存/修改/删除图片、文件、崩溃日志等信息 NSPhotoLibraryUsageDescription 读取相册中内容
        允许App读取存储中的图片、文件等内容，主要用于帮助您发布信息等功能 NSCameraUsageDescription 使用摄像头
        用于帮助您完成音视频等信息发布、完成扫描二维码等需要使用该权限的相关功能 NSLocationAlwaysUsageDescription
        持续获取地理位置 用于完成音视频等信息发布内容上传以及基于地理位置的服务（LBS）等相关功能
        NSLocationWhenInUseUsageDescription 仅App被使用时获取地理位置
        用于完成音视频等信息发布内容上传以及基于地理位置的服务（LBS）等相关功能 NSContactsUsageDescription
        读取用户通讯录
        第三方组件在其相关功能所必需的情况下，会向您申请该权限，并通过其协议说明使用的目的，请您在授权前仔细阅读
        NSCalendarsUsageDescription 读取日历 用于完成相关提醒功能 NSMicrophoneUsageDescription 使用麦克风
        用于帮助您完成音视频等信息发布等需要使用该权限的相关功能<br />
        9、为您提供安全保障<br />
        为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或海尔卡奥斯相关协议规则的情况，我们可能使用或整合您的用户信息、消费信息、设备信息、有关网络日志以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。<br />
        10、其他用途<br />
        我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。<br />
        11、征得授权同意的例外<br />
        根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下收集、使用一些必要的个人信息：<br />
        （1）为订立、履行您作为一方当事人的合同所必需；<br />
        （2）为履行法定义务所必需；<br />
        （3）为应对突发公共卫生事件，或者紧急情况下为保护个人的生命健康和财产安全所必需；<br />
        （4）为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；<br />
        （5）在合理的范围内处理您自行公开或者其他已经合法公开的个人信息；<br />
        （6）法律、行政法规规定的其他情形。<br />
        根据法律规定，共享、转让经去匿名化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。<br />
        二、我们如何使用Cookie和同类技术<br />
        为确保平台正常运转，我们会在您的计算机或移动设备上存储名为cookie的数据文件。Cookie通常包含用户身份标识符、城市名称以及一些字符。Cookie主要的功能是便于您使用平台产品和服务，以及帮助平台统计访问数据等。<br />
        我们不会将cookie用于本《卡奥斯海云智造隐私政策》所述目的之外的任何用途。您可以根据自己的偏好管理或删除cookie。有关详情，可以浏览aboutcookies.org平台。您可以清除计算机上保存的所有cookie，大部分网络浏览器都设有阻止cookie的功能。如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置，您可能无法使用由我们提供的、依赖于Cookie的服务或相应功能。您可以通过更改您的浏览器设置限制我们对Cookie的使用。以Chrome浏览器为例，您可以在Chrome浏览器右上方的下拉菜单的“浏览器设置”中，通过（“【设置】-【高级】-【清除浏览数据】”），选择“【清除您的Cookie】”。<br />
        三、我们如何委托处理、共享、转让、公开披露您的信息<br />
        1、委托处理<br />
        本业务功能中某些具体的模块或功能由外部供应商提供。例如我们会聘请服务提供商来协助我们提供客户支持。<br />
        对我们委托处理个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的要求、个人信息保护政策以及其他任何相关的保密和安全措施来处理个人信息。<br />
        2、共享 我们承诺对您的信息进行严格保密，我们不会与任何公司、组织或个人共享您的信息，但以下情况除外：<br />
        （1）在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息；<br />
        （2）共享的个人信息是去匿名化化处理后的脱敏信息，且共享第三方无法重新识别此类信息的自然人主体；<br /><br />
        （3）在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息；<br />
        （3）为了保护信息主体或其他个人生命、财产或社会公众的利益免遭受损害而有必要提供您的信息给第三方；<br />
        （4）与我们关联的公司共享。您的信息可能会在我们的关联公司之间共享。我们只会共享必要的信息，且这种共享受本政策的约束。关联公司如要改变信息的处理目的，将再次征求您的授权同意；<br />
        （5）与授权合作伙伴共享：仅为实现本隐私权政策中声明的目的，我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于与产品或服务无关的其他用途。<br />
        目前，我们的授权合作伙伴包括以下类型：<br />
        广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息（指可以识别您身份的信息，例如姓名或电子邮箱，通过这些信息可以联系到您或识别您的身份）与提供广告、分析服务的合作伙伴共享。我们会向这些合作伙伴提供有关其广告覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您个人。例如，只有在广告主同意遵守我们的广告发布准则后，我们才可能会告诉广告主他们广告的效果如何，或者有多少人看了他们广告或在看到广告后安装了应用，或者向这些合作伙伴提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客。<br />
        供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利或进行学术研究和调查。<br />
        3、转让 我们不会将您的个人信息转让给除卡奥斯海云智造的关联公司外的任何公司、组织和个人，但以下情形除外：<br />
        （1）事先获得您的单独同意； <br />
        （2）满足法律法规、法律程序的要求或强制性的政府要求或司法裁定；<br />
        （3）随着我们业务的持续发展，我们或我们的关联公司有可能涉及合并、分立、清算、资产或业务的收购或出售等交易，您的信息有可能作为此类交易的一部分而被转移，我们将确保信息在转移时的保密性，并要求新的持有您信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。<br />
        4、公开披露<br />
        我们公开披露您的个人信息会采用符合行业内标准的安全保护措施。我们仅会在以下情形下，公开披露您的个人信息：<br />
        （1）获得您的单独同意；<br />
        （2）基于法律法规、法律程序、诉讼或政府主管部门强制要求下。<br />
        5、例外情形<br />
        在以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：<br />
        （1）为订立、履行您作为一方当事人的合同所必需； <br />
        （2）为履行法定义务所必需；<br />
        （3）为应对突发公共卫生事件，或者紧急情况下为保护个人的生命健康和财产安全所必需；<br />
        （4）为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；<br />
        （5）在合理的范围内处理您自行公开或者其他已经合法公开的个人信息；<br />
        （6）法律、行政法规规定的其他情形；<br />
        （7）根据法律规定，共享、转让经去匿名化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。<br />
        四、我们如何保护您的个人信息 1、信息存储<br />
        我们仅在实现处理目的的最小必要范围内留存您的个人信息。您在使用卡奥斯海云智造产品及服务期间，我们将持续为您保存您的个人信息。如果您注销账户或主动删除上述信息，我们将依据《个人信息保护法》等相关法律法规的规定删除您的信息，但法律、行政法规规定的保存期限未届满，或者删除个人信息从技术上难以实现的除外。在您注销帐户或主动删除上述信息后，我们不会再对您的个人信息进行商业化使用，但我们可能会对您的个人信息进行删除或匿名化处理后使用。<br />
        2、存储地点<br />
        原则上，我们在中华人民共和国境内收集和产生的个人信息仅储存于中华人民共和国境内。如需跨境传输，我们将会获得您的单独同意。此类管辖区可能设有不同的数据保护法，在此类情况下，我们会确保您的个人信息得到在中华人民共和国境内足够同等的保护。例如，我们会请求您对跨境转移个人信息的单独同意，或者在跨境数据转移之前实施数据去标识化匿名化等安全举措。我们将根据法律、法规和相关监管要求进行个人信息保护影响评估，并且完成通过国家网信部门组织的安全评估和/或按照国家网信部门的规定经专业机构进行个人信息保护认证和/或按照国家网信部门制定的标准合同与境外接收方订立合同，约定我们与境外接收方的权利和义务。<br />
        3、保护措施<br />
        （1）我们已采取符合业界标准、合理可行的安全防护措施保护您的信息，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。例如，我们的网络服务采取了传输层安全协议等加密技术，确保您的数据在网络传输过程的安全；我们采用加密技术对数据的存储进行加密；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息。<br />
        （2）我们从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。目前，卡奥斯海云智造已经通过了国家信息安全等级保护（三级）的备案和测评；我们通过了国际权威的ISO
        27001信息安全管理体系认证、CSA STAR云计算安全评估认证和ISO
        29151个人隐私数据保护体系认证；我们会举办安全培训课程，加强员工对于保护个人信息重要性的认识。<br />
        （3）我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本《卡奥斯海云智造隐私政策》所述目的所需的期限内保留您的个人信息（除非法律有强制的存留要求）。<br />
        （4）使用卡奥斯海云智造服务时，我们强烈建议您不要使用非卡奥斯海云智造推荐的通信方式发送您的信息。您可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、分享时，您可以自主选择沟通、分享的对象，作为能够看到您的联络方式、交流信息或分享内容等相关信息的第三方。<br />
        4、安全事件响应<br />
        （1）在使用卡奥斯海云智造服务进行沟通时，请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即通过本隐私政策公布的联系方式联络我们，以便我们根据您的申请采取相应措施。请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息，如您在沟通时选择上传包含个人信息的图片。请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。<br />
        （2）我们会制定网络安全事件应急预案，及时处置系统漏洞、计算机病毒、网络攻击、网络侵入等安全风险，在发生危害网络安全的事件时，我们会立即启动应急预案，采取相应的补救措施，并按照规定向有关主管部门报告。<br />
        （3）个人信息泄露、毁损、丢失属于公司级特大安全事件，我们会负责定期组织工作组成员进行安全预案演练，防止此类安全事件发生。若一旦不幸发生，我们将按照最高优先级启动应急预案，组成应急响应小组，在最短时间内追溯原因并减少损失。<br />
        （4）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时通过软件内部提醒、邮件、短信或电话等方式向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处理措施、您可自主防范和降低的风险的建议、对您的补救措施等。我们将及时将事件相关情况通过消息推送、平台公告等方式告知您，难以逐一告知时我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。<br />
        5、例外情况<br />
        当我们的产品或服务发生停止运营的情形时，我们将按照法律规定向用户进行通知，通知方式包括但不限于消息推送、平台公告等，并在合理期限内删除或匿名化处理您的个人信息。<br />
        互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。<br />
        五、您的权利 按照中华人民共和国相关的法律、法规、标准，我们保障您对自己的个人信息行使以下权利：<br />
        1您可以点击APP“我的”菜单，进行个人信息查询、修改。 <br />
        2您可以通过本《卡奥斯海云智造隐私政策》公布的联系方式，申请删除您的个人信息或注销您的帐号；<br />
        在以下情形中，您可以向我们提出删除个人信息的请求： 例如: ①如果我们处理个人信息的行为违反法律法规；<br />
        ②如果我们处理个人信息的目的已实现、无法实现或者实现处理目的不再必要；<br />
        ③如果我们收集、使用您的个人信息，却未征得您的明确同意； ④如果您撤回您的授权同意；<br />
        ⑤如果我们处理个人信息的行为严重违反了与您的约定； ⑥如果您不再使用我们的产品或服务，或您主动注销了账号；<br />
        ⑦如果我们永久不再为您提供产品或服务； ⑧如果您的个人信息保存期限届满；<br />
        ⑨法律、行政法规规定的其他情形。<br />
        例外情况：在法律、行政法规规定的保存期限未届满或删除个人信息从技术上难以实现的，我们将无法完全删除您的个人信息。但我们将停止除存储和采取必要的安全保护措施之外的个人信息处理。<br />
        若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，要求其及时删除，除非法律法规另有规定，或这些主体获得您的独立授权。<br />
        当您从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。<br />
        3您可以在设备本身操作系统中关闭地理位置信息、通讯录、摄像头、麦克风、相册权限、日历权限，改变同意范围或撤回您的授权。<br />
        如果您想要撤回同意、删除您的信息，或是您发现我们违反法律、行政法规的规定或者双方的约定收集、使用其个人信息，您想要向我们提出的请求，您可以通过本《卡奥斯海云智造隐私政策》公布的联系方式与我们取得联系，我们将在验证您身份后的三十日内回复并进行相关操作。<br />
        4、响应您的上述请求<br />
        为了保障安全，您需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。对于合理的请求，我们会积极响应；但对于多次重复、超出合理限度的请求，我们将视情况予以拒绝。<br />
        5、提前获知产品和服务停止运营<br />
        若因特殊原因导致卡奥斯海云智造被迫停止运营，我们将按照法律法规的要求，在产品和/或服务的主页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您，并将停止对您个人信息的收集，同时会按照法律规定对所持有的您的个人信息进行删除或匿名化处理等。<br />
        6、响应请求的例外 在以下情形中，按照法律法规要求，我们将无法响应您的上述请求：<br />
        （1）与国家安全、国防安全直接相关的； （2）与公共安全、公共卫生、重大公共利益直接相关的；<br />
        （3）与犯罪侦查、起诉、审判和执行判决等直接相关的；<br />
        （4）证据表明您可能存在明显恶意、滥用权力及占用平台资源、辱骂客服人员等相关情形的（如您的请求将危害公共安全）；<br />
        （5）您和其他人合法权益，或您的请求超出了一般技术手段和商业成本可覆盖的范围）；<br />
        （6）响应个人信息主体的请求将导致您或其他个人、组织的合法权益受到严重损害的；<br />
        （7）涉及商业秘密的。<br />
        六、我们如何处理未成年人的个人信息<br />
        如果没有父母或监护人的同意，未成年人不得创建自己的用户账户。如您为未成年人的，建议您请您的父母或监护人仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。<br />
        对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。<br />
        七、本政策的适用及更新<br />
        我们保留不时更新或修改本政策的权利。我们可能适时修订本政策内容。如该等修订会导致您在本政策项下权利的重大变更，我们将在变更生效前，通过系统推送、电子邮件、短信、公告等方式通知您。若您不同意该等修订应立即停止使用卡奥斯海云智造的产品和服务，或通过本政策公布的联系方式联系我们要求注销您的帐号。若您继续使用我们的产品和服务，即表示您同意接受修订后的本政策的约束。本政策所指的重大变更包括但不限于：<br />
        （1）我们的服务模式发生重大变化。如处理信息的目的、处理的信息类型、信息的使用方式等；
        （2）我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；<br />
        （3）信息共享、转让或公开披露的主要对象发生变化； <br />
        （4）您参与信息处理方面的权利及其行使方式发生重大变化；<br />
        （5）我们负责处理信息安全的责任部门、联络方式及投诉渠道发生变化时； <br />
        （6）信息安全影响评估报告表明存在高风险时。<br />
        八、如何联系我们<br />
        如果您对本《卡奥斯海云智造隐私政策》及我们对您的个人信息的处理有任何疑问、意见、建议，请通过文件开头公布的方式<br />
        与我们联系。一般情况下，我们会在15日内对您的请求予以答复。<br />
      </template>
    </scroll-view>
  </view>
</template>
<script setup lang="ts">
import { onLoad } from '@dcloudio/uni-app'
import { ref } from 'vue'
const type = ref('')
onLoad((options) => {
  type.value = options.type
})
</script>
<style lang="scss"></style>
